openfoam13/DTCMoving_Overset_Foundation13/background/constant/momentumTransport
FoamFile
{
    format ascii;
    class dictionary;
    object momentumTransport;
}
simulationType RAS;
RAS
{
    model kOmegaSST;
    turbulence on;
}
