openfoam13/DTCMoving_Overset_Foundation13/background/system/fvConstraints
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fvConstraints;
}
marineOverset
{
    type marineOversetConstraint;
    libs ("libmarineOversetProbe.so");
    fields (U p_rgh alpha.water k omega epsilon nut);
}
